import seviceType from "@/app/types/serviceItemList";

const  data: seviceType[] = [
  {
    title: "Аналитика и планирование",
    sevice: [
      "Исследование рынка: Анализ конкурентов, целевой аудитории и тенденций в отрасли.",
      "Определение целей и задач: Четкое понимание того, что должен достичь сайт (продажи, информирование, привлечение пользователей и т.д.).",
      "Составление технического задания (ТЗ)",
    ],
  },
  {
    title: "Дизайн",
    sevice: [
      "Создание прототипов: Разработка каркасных макетов (wireframes) для визуализации структуры страниц.",
      "Дизайн пользовательского интерфейса (UI): Разработка визуального стиля сайта, включая цветовую палитру, шрифты, иконки и другие элементы.",
      "Создание пользовательского опыта (UX): Проектирование взаимодействия пользователя с сайтом, чтобы сделать его удобным и интуитивно понятным.",
    ],
  },
  {
    title: "Фронтенд-разработка",
    sevice: [
      "HTML/CSS верстка: Создание структуры страниц и стилей для визуального оформления.",
      "JavaScript: Добавление интерактивности на сайт (например, анимации, формы, динамическое обновление контента).",
      "Адаптивный дизайн: Обеспечение корректного отображения сайта на различных устройствах (мобильные телефоны, планшеты, десктопы).",
    ],
  },
  {
    title: "Бэкенд-разработка",
    sevice: [
      "Выбор технологии: Определение стека технологий (языки программирования, фреймворки, базы данных и т.д.).",
      "API: Разработка интерфейсов для взаимодействия между фронтендом и бэкендом, а также с внешними сервисами.",
      "Создание серверной логики: Разработка функционала, который обрабатывает запросы от клиента, взаимодействует с базой данных и возвращает результаты.",
      "Интеграция с базой данных: Настройка хранилища данных для хранения информации о пользователях, контенте и других элементах сайта.",
    ],
  },
  {
    title: "Тестирование",
    sevice: [
      "Функциональное тестирование: Проверка работоспособности всех функций сайта.",
      "Кроссбраузерное тестирование: Убедиться, что сайт работает корректно в различных браузерах.",
      "Тестирование на мобильных устройствах: Проверка адаптивности и удобства использования на смартфонах и планшетах.",
      "Нагрузочное тестирование: Оценка производительности сайта под нагрузкой.",
    ],
  },
];

export default data